app/controllers/answers_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" IS NULL LIMIT 1
---
  def index
    # @answers = Answer.all
    @currentquestion = Question.find_by_id(session[:question_id])

SELECT "questions".* FROM "questions" WHERE "questions"."id" = 2 LIMIT 1
---
  def new
    if params[:q_id] != nil
      @currentquestion = Question.find(params[:q_id])

SELECT "questions".* FROM "questions" WHERE "questions"."id" IS NULL LIMIT 1
INSERT INTO "answers" ("body", "created_at", "notice", "pattern", "question_id", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["body", "hkghkgjk"], ["created_at", Mon, 18 Nov 2013 18:52:35 UTC +00:00], ["notice", "gjkg"], ["pattern", ""], ["question_id", 3], ["updated_at", Mon, 18 Nov 2013 18:52:35 UTC +00:00]]
---
  def create

    @answer = Answer.new(answer_params)
    @currenttype = Question.find_by_id(session[:questiontype])

    @currentquestion = Question.find_by_id(session[:question_id])

    @answer.question_id = @currentquestion.id

    respond_to do |format|
      if @answer.save

SELECT "answers".* FROM "answers" WHERE "answers"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "questions".* FROM "questions" WHERE "questions"."id" IS NULL LIMIT 1
UPDATE "answers" SET "notice" = ?, "body" = ?, "correct" = ?, "pattern" = ?, "updated_at" = ? WHERE "answers"."id" = 1  [["notice", "notice"], ["body", "body"], ["correct", true], ["pattern", "abc"], ["updated_at", Thu, 14 Nov 2013 15:06:05 UTC +00:00]]
---
  def update
    @answer = Answer.find(params[:id])
    @currentquestion = Question.find_by_id(session[:question_id])
    @answer.question_id = @currentquestion.id

    respond_to do |format|
      if @answer.update(answer_params)