app/controllers/courses_controller.rb

SELECT "courses".* FROM "courses" WHERE "courses"."id" = ? LIMIT 1  [["id", "2"]]
---
  def select
    @course = Course.find(params[:id])

INSERT INTO "courses" ("created_at", "description", "topic", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", Thu, 14 Nov 2013 12:59:30 UTC +00:00], ["description", "123"], ["topic", "blablubber"], ["updated_at", Thu, 14 Nov 2013 12:59:30 UTC +00:00]]
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "description" = ?, "updated_at" = ? WHERE "courses"."id" = 1  [["description", "1234"], ["updated_at", Thu, 14 Nov 2013 12:59:45 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)