app/controllers/questions_controller.rb

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
---
  def select
    @question = Question.find(params[:id])

SELECT "topics".* FROM "topics" WHERE "topics"."id" IS NULL LIMIT 1
---
  def index
    # @questions = Question.all
    @currenttopic = Topic.find_by_id(session[:topic_id])

SELECT "topics".* FROM "topics" WHERE "topics"."id" IS NULL LIMIT 1
INSERT INTO "questions" ("created_at", "topic_id", "updated_at") VALUES (?, ?, ?)  [["created_at", Thu, 14 Nov 2013 14:50:09 UTC +00:00], ["topic_id", 2], ["updated_at", Thu, 14 Nov 2013 14:50:09 UTC +00:00]]
---
  def create
    @question = Question.new(question_params)
    @currenttopic = Topic.find_by_id(session[:topic_id])
    @question.topic_id = @currenttopic.id

    respond_to do |format|
      if @question.save

SELECT "questions".* FROM "questions" WHERE "questions"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "topics".* FROM "topics" WHERE "topics"."id" IS NULL LIMIT 1
UPDATE "questions" SET "type" = ?, "name" = ?, "body" = ?, "noticewrong" = ?, "noticeright" = ?, "notice" = ?, "updated_at" = ? WHERE "questions"."id" = 1  [["type", "multiplechoice"], ["name", "test"], ["body", "test"], ["noticewrong", "test"], ["noticeright", ""], ["notice", ""], ["updated_at", Thu, 14 Nov 2013 16:02:57 UTC +00:00]]
---
  def update
    @question = Question.find(params[:id])
    @currenttopic = Topic.find_by_id(session[:topic_id])
    @question.topic_id = @currenttopic.id

    respond_to do |format|
      if @question.update(question_params)