app/controllers/topics_controller.rb

  def select
    @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "2"]]

  def index
    @currentcourse = Course.find_by_id(session[:course_id])
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" IS NULL LIMIT 1

  def create
    @topic = Topic.new(topic_params)
    @currentcourse = Course.find_by_id(session[:course_id])

    @topic.course_id = @currentcourse.id


    respond_to do |format|
      if @topic.save
---
SELECT "courses".* FROM "courses" WHERE "courses"."id" IS NULL LIMIT 1
INSERT INTO "topics" ("course_id", "created_at", "description", "name", "updated_at") VALUES (?, ?, ?, ?, ?)  [["course_id", 0], ["created_at", Thu, 14 Nov 2013 13:06:52 UTC +00:00], ["description", "bier"], ["name", "bier"], ["updated_at", Thu, 14 Nov 2013 13:06:52 UTC +00:00]]

  def update
    @topic = Topic.find(params[:id])
    @currentcourse = Course.find_by_id(session[:course_id])
    @topic.course_id = @currentcourse.id

    respond_to do |format|
      if @topic.update(topic_params)
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "2"]]
SELECT "courses".* FROM "courses" WHERE "courses"."id" IS NULL LIMIT 1
UPDATE "topics" SET "name" = ?, "description" = ?, "updated_at" = ? WHERE "topics"."id" = 3  [["name", "sdfsdf"], ["description", "sdfsdf"], ["updated_at", Sat, 16 Nov 2013 11:10:58 UTC +00:00]]